Revit 2024 API
MEPAnalyticalSystem.GetAirSystemData Method
 Returns the air system data, null if not available.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public AirSystemData GetAirSystemData()
Visual Basic
Public Function GetAirSystemData As AirSystemData
Visual C++
public:
AirSystemData^ GetAirSystemData()
See Also
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace